; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v8)
             (pred_10 ?v11 ?v6)
             (pred_3 ?v2 ?v6)
             (pred_7 ?v10 ?v2 )
	     (pred_5 ?v2)
             (pred_11 ?v12)
             (pred_12 ?v11)
             (pred_1 ?v6)
             (pred_6 ?v2)
             (pred_8 ?v11)
             (pred_2 ?v2)
             (pred_4 ))



(:action op_2
:parameters (?v5 ?v7 ?v3 ?v13)
:precondition (and (pred_11 ?v5) (pred_11 ?v7) (pred_12 ?v3) (pred_1 ?v13)
          (pred_9 ?v5 ?v7) (pred_10 ?v3 ?v13)
                   (pred_3 ?v7 ?v13) (pred_5 ?v5) 
                   (pred_6 ?v7) (pred_8 ?v3))
:effect (and  (pred_2 ?v7) (not (pred_6 ?v7))))


(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_11 ?v5) (pred_11 ?v9)
               (pred_5 ?v5) (pred_9 ?v5 ?v9) (pred_2 ?v9))
:effect (and (pred_5 ?v9) (not (pred_5 ?v5))))

(:action op_3
:parameters (?v5 ?v3)
:precondition (and (pred_11 ?v5) (pred_12 ?v3) 
                  (pred_5 ?v5) (pred_7 ?v3 ?v5) (pred_4 ))
:effect (and (pred_8 ?v3)
   (not (pred_7 ?v3 ?v5)) (not (pred_4 ))))


(:action op_5
:parameters (?v5 ?v1 ?v4)
:precondition (and (pred_11 ?v5) (pred_12 ?v1) (pred_12 ?v4)
                  (pred_5 ?v5) (pred_8 ?v4) (pred_7 ?v1 ?v5))
:effect (and (pred_8 ?v1) (pred_7 ?v4 ?v5)
        (not (pred_8 ?v4)) (not (pred_7 ?v1 ?v5))))

(:action op_1
:parameters (?v5 ?v3)
:precondition (and (pred_11 ?v5) (pred_12 ?v3) 
                  (pred_5 ?v5) (pred_8 ?v3))
:effect (and (pred_4 ) (pred_7 ?v3 ?v5) (not (pred_8 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_19 obj_18 obj_06 obj_08 obj_03 obj_15 obj_11 obj_12 obj_05 obj_13 obj_02 obj_07 obj_16 obj_01 obj_14
    obj_10 obj_09
    obj_20 obj_04
    )

    (:init
       (pred_4)

       (pred_11 obj_17)
       (pred_11 obj_19)
       (pred_11 obj_18)
       (pred_11 obj_06)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_11 obj_01)
       (pred_11 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_04)

       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_18 obj_15)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_15 obj_18)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_05 obj_16)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_07 obj_16)
       (pred_9 obj_07 obj_12)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_16 obj_07)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_14 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_13)
       (pred_3  obj_18 obj_10)
       (pred_3  obj_13 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_03)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_14)

       (pred_10  obj_20 obj_10)
       (pred_10  obj_04 obj_09)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_04 obj_07)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_7 obj_04 obj_14)
    ))
(:constraints
  (always (not (pred_5 obj_03)))
)
)

; plan
1. (op_4 obj_19 obj_17)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_17)
   goals met: 0 of 1
2. (op_4 obj_17 obj_08)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_12)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_07)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_07)
   goals met: 0 of 1
5. (op_3 obj_07 obj_04)
   deleted: (pred_7 obj_04 obj_07) (pred_4)
   added: (pred_8 obj_04)
   goals met: 0 of 1
6. (op_4 obj_07 obj_16)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_16)
   goals met: 0 of 1
7. (op_4 obj_16 obj_01)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_01)
   goals met: 0 of 1
8. (op_4 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 0 of 1
9. (op_1 obj_14 obj_04)
   deleted: (pred_8 obj_04)
   added: (pred_4) (pred_7 obj_04 obj_14)
   goals met: 1 of 1
